e-tinkers/ArduinoCore-stm32l0/boards.txt
menu.usb=USB Type
menu.dosfs=DOSFS
menu.speed=CPU Speed
menu.opt=Optimize

##############################################################

# Tech Studio Murata LoRa Board
# ---------------------------------------
TechStudio-LoRa.name=TechStudio-LoRa
TechStudio-LoRa.vid.0=0x7da8
TechStudio-LoRa.pid.0=0x89a0

TechStudio-LoRa.upload.tool=stm32l0_dfu
TechStudio-LoRa.upload.protocol=dfu
TechStudio-LoRa.upload.maximum_size=196608
TechStudio-LoRa.upload.maximum_data_size=20480
TechStudio-LoRa.upload.use_1200bps_touch=true
TechStudio-LoRa.upload.wait_for_upload_port=false
TechStudio-LoRa.upload.native_usb=false

TechStudio-LoRa.build.mcu=cortex-m0plus
TechStudio-LoRa.build.f_cpu=32000000L
TechStudio-LoRa.build.board=STM32L0_TechStudio
TechStudio-LoRa.build.arch=stm32l0
TechStudio-LoRa.build.core=arduino
TechStudio-LoRa.build.vid=0x7da8
TechStudio-LoRa.build.pid=0x89a0
TechStudio-LoRa.build.did=0xffff
TechStudio-LoRa.build.usb_manufacturer="Tech Studio Design LLP"
TechStudio-LoRa.build.usb_product="TechStudio Murata Lora Board"
TechStudio-LoRa.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
TechStudio-LoRa.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
TechStudio-LoRa.build.openocdscript=openocd_scripts/TechStudio-LoRa.cfg
TechStudio-LoRa.build.variant=TechStudio-LoRa
TechStudio-LoRa.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
TechStudio-LoRa.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

TechStudio-LoRa.menu.usb.cdc=Serial
TechStudio-LoRa.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
TechStudio-LoRa.menu.usb.cdc_msc=Serial + Mass Storage
TechStudio-LoRa.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
TechStudio-LoRa.menu.usb.none=No USB
TechStudio-LoRa.menu.usb.none.build.usb_type=USB_TYPE_NONE

TechStudio-LoRa.menu.dosfs.none=None
TechStudio-LoRa.menu.dosfs.none.build.dosfs_sdcard=0
TechStudio-LoRa.menu.dosfs.none.build.dosfs_sflash=0
TechStudio-LoRa.menu.dosfs.sdspi=SDCARD (SPI)
TechStudio-LoRa.menu.dosfs.sdspi.build.dosfs_sdcard=1
TechStudio-LoRa.menu.dosfs.sdspi.build.dosfs_sflash=0
TechStudio-LoRa.menu.dosfs.sfspi=SFLASH (SPI)
TechStudio-LoRa.menu.dosfs.sfspi.build.dosfs_sdcard=0
TechStudio-LoRa.menu.dosfs.sfspi.build.dosfs_sflash=1

TechStudio-LoRa.menu.speed.32=32 MHz
TechStudio-LoRa.menu.speed.32.build.f_cpu=32000000L
TechStudio-LoRa.menu.speed.16=16 MHz (No USB)
TechStudio-LoRa.menu.speed.16.build.f_cpu=16000000L
TechStudio-LoRa.menu.speed.4=4.2 MHz (No USB)
TechStudio-LoRa.menu.speed.4.build.f_cpu=4200000L

TechStudio-LoRa.menu.opt.os=Smallest Code
TechStudio-LoRa.menu.opt.os.build.flags.optimize=-Os
TechStudio-LoRa.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
TechStudio-LoRa.menu.opt.o1=Fast
TechStudio-LoRa.menu.opt.o1.build.flags.optimize=-O1
TechStudio-LoRa.menu.opt.o1.build.flags.ldspecs=
TechStudio-LoRa.menu.opt.o2=Faster
TechStudio-LoRa.menu.opt.o2.build.flags.optimize=-O2
TechStudio-LoRa.menu.opt.o2.build.flags.ldspecs=
TechStudio-LoRa.menu.opt.o3=Fastest
TechStudio-LoRa.menu.opt.o3.build.flags.optimize=-O3
TechStudio-LoRa.menu.opt.o3.build.flags.ldspecs=

# Tlera Grasshopper
# ---------------------------------------
Grasshopper-L082CZ.name=Grasshopper-L082CZ
Grasshopper-L082CZ.vid.0=0x1209
Grasshopper-L082CZ.pid.0=0x6665

Grasshopper-L082CZ.upload.tool=stm32l0_dfu
Grasshopper-L082CZ.upload.protocol=dfu
Grasshopper-L082CZ.upload.maximum_size=196608
Grasshopper-L082CZ.upload.maximum_data_size=20480
Grasshopper-L082CZ.upload.use_1200bps_touch=true
Grasshopper-L082CZ.upload.wait_for_upload_port=false
Grasshopper-L082CZ.upload.native_usb=false

Grasshopper-L082CZ.build.mcu=cortex-m0plus
Grasshopper-L082CZ.build.f_cpu=32000000L
Grasshopper-L082CZ.build.board=STM32L0_GRASSHOPPER
Grasshopper-L082CZ.build.arch=stm32l0
Grasshopper-L082CZ.build.core=arduino
Grasshopper-L082CZ.build.vid=0x1209
Grasshopper-L082CZ.build.pid=0x6665
Grasshopper-L082CZ.build.did=0xffff
Grasshopper-L082CZ.build.usb_manufacturer="Tlera Corporation"
Grasshopper-L082CZ.build.usb_product="Grasshopper"
Grasshopper-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Grasshopper-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Grasshopper-L082CZ.build.openocdscript=openocd_scripts/grasshopper-l082cz.cfg
Grasshopper-L082CZ.build.variant=Grasshopper-L082CZ
Grasshopper-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Grasshopper-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

Grasshopper-L082CZ.menu.usb.cdc=Serial
Grasshopper-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Grasshopper-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Grasshopper-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Grasshopper-L082CZ.menu.usb.none=No USB
Grasshopper-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Grasshopper-L082CZ.menu.dosfs.none=None
Grasshopper-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Grasshopper-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Grasshopper-L082CZ.menu.dosfs.sdspi=SDCARD (SPI)
Grasshopper-L082CZ.menu.dosfs.sdspi.build.dosfs_sdcard=1
Grasshopper-L082CZ.menu.dosfs.sdspi.build.dosfs_sflash=0
Grasshopper-L082CZ.menu.dosfs.sfspi=SFLASH (SPI)
Grasshopper-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Grasshopper-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Grasshopper-L082CZ.menu.speed.32=32 MHz
Grasshopper-L082CZ.menu.speed.32.build.f_cpu=32000000L
Grasshopper-L082CZ.menu.speed.16=16 MHz (No USB)
Grasshopper-L082CZ.menu.speed.16.build.f_cpu=16000000L
Grasshopper-L082CZ.menu.speed.4=4.2 MHz (No USB)
Grasshopper-L082CZ.menu.speed.4.build.f_cpu=4200000L

Grasshopper-L082CZ.menu.opt.os=Smallest Code
Grasshopper-L082CZ.menu.opt.os.build.flags.optimize=-Os
Grasshopper-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Grasshopper-L082CZ.menu.opt.o1=Fast
Grasshopper-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Grasshopper-L082CZ.menu.opt.o1.build.flags.ldspecs=
Grasshopper-L082CZ.menu.opt.o2=Faster
Grasshopper-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Grasshopper-L082CZ.menu.opt.o2.build.flags.ldspecs=
Grasshopper-L082CZ.menu.opt.o3=Fastest
Grasshopper-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Grasshopper-L082CZ.menu.opt.o3.build.flags.ldspecs=


# Tlera Cricket
# ---------------------------------------
Cricket-L082CZ.name=Cricket-L082CZ
Cricket-L082CZ.vid.0=0x1209
Cricket-L082CZ.pid.0=0x6664

Cricket-L082CZ.upload.tool=stm32l0_dfu
Cricket-L082CZ.upload.protocol=dfu
Cricket-L082CZ.upload.maximum_size=196608
Cricket-L082CZ.upload.maximum_data_size=20480
Cricket-L082CZ.upload.use_1200bps_touch=true
Cricket-L082CZ.upload.wait_for_upload_port=false
Cricket-L082CZ.upload.native_usb=false

