e-tinkers/ArduinoCore-stm32l0/boards.txt
Cricket-L082CZ.build.mcu=cortex-m0plus
Cricket-L082CZ.build.f_cpu=32000000L
Cricket-L082CZ.build.board=STM32L0_CRICKET
Cricket-L082CZ.build.arch=stm32l0
Cricket-L082CZ.build.core=arduino
Cricket-L082CZ.build.vid=0x1209
Cricket-L082CZ.build.pid=0x6664
Cricket-L082CZ.build.did=0xffff
Cricket-L082CZ.build.usb_manufacturer="Tlera Corporation"
Cricket-L082CZ.build.usb_product="Cricket"
Cricket-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Cricket-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Cricket-L082CZ.build.openocdscript=openocd_scripts/cricket-l082cz.cfg
Cricket-L082CZ.build.variant=Cricket-L082CZ
Cricket-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Cricket-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

Cricket-L082CZ.menu.usb.cdc=Serial
Cricket-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Cricket-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Cricket-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Cricket-L082CZ.menu.usb.none=No USB
Cricket-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Cricket-L082CZ.menu.dosfs.none=None
Cricket-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Cricket-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Cricket-L082CZ.menu.dosfs.sfspi=SFLASH
Cricket-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Cricket-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Cricket-L082CZ.menu.speed.32=32 MHz
Cricket-L082CZ.menu.speed.32.build.f_cpu=32000000L
Cricket-L082CZ.menu.speed.16=16 MHz (No USB)
Cricket-L082CZ.menu.speed.16.build.f_cpu=16000000L
Cricket-L082CZ.menu.speed.4=4.2 MHz (No USB)
Cricket-L082CZ.menu.speed.4.build.f_cpu=4200000L

Cricket-L082CZ.menu.opt.os=Smallest Code
Cricket-L082CZ.menu.opt.os.build.flags.optimize=-Os
Cricket-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Cricket-L082CZ.menu.opt.o1=Fast
Cricket-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Cricket-L082CZ.menu.opt.o1.build.flags.ldspecs=
Cricket-L082CZ.menu.opt.o2=Faster
Cricket-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Cricket-L082CZ.menu.opt.o2.build.flags.ldspecs=
Cricket-L082CZ.menu.opt.o3=Fastest
Cricket-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Cricket-L082CZ.menu.opt.o3.build.flags.ldspecs=

# Tlera Cicada
# ---------------------------------------
Cicada-L082CZ.name=Cicada-L082CZ
Cicada-L082CZ.vid.0=0x1209
Cicada-L082CZ.pid.0=0x6663

Cicada-L082CZ.upload.tool=stm32l0_dfu
Cicada-L082CZ.upload.protocol=dfu
Cicada-L082CZ.upload.maximum_size=196608
Cicada-L082CZ.upload.maximum_data_size=20480
Cicada-L082CZ.upload.use_1200bps_touch=true
Cicada-L082CZ.upload.wait_for_upload_port=false
Cicada-L082CZ.upload.native_usb=false

Cicada-L082CZ.build.mcu=cortex-m0plus
Cicada-L082CZ.build.f_cpu=32000000L
Cicada-L082CZ.build.board=STM32L0_CICADA
Cicada-L082CZ.build.arch=stm32l0
Cicada-L082CZ.build.core=arduino
Cicada-L082CZ.build.vid=0x1209
Cicada-L082CZ.build.pid=0x6663
Cicada-L082CZ.build.did=0xffff
Cicada-L082CZ.build.usb_manufacturer="Tlera Corporation"
Cicada-L082CZ.build.usb_product="Cicada"
Cicada-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Cicada-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Cicada-L082CZ.build.openocdscript=openocd_scripts/cicada-l082cz.cfg
Cicada-L082CZ.build.variant=Cicada-L082CZ
Cicada-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Cicada-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

Cicada-L082CZ.menu.usb.cdc=Serial
Cicada-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Cicada-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Cicada-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Cicada-L082CZ.menu.usb.none=No USB
Cicada-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Cicada-L082CZ.menu.dosfs.none=None
Cicada-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Cicada-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Cicada-L082CZ.menu.dosfs.sfspi=SFLASH
Cicada-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Cicada-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Cicada-L082CZ.menu.speed.32=32 MHz
Cicada-L082CZ.menu.speed.32.build.f_cpu=32000000L
Cicada-L082CZ.menu.speed.16=16 MHz (No USB)
Cicada-L082CZ.menu.speed.16.build.f_cpu=16000000L
Cicada-L082CZ.menu.speed.4=4.2 MHz (No USB)
Cicada-L082CZ.menu.speed.4.build.f_cpu=4200000L

Cicada-L082CZ.menu.opt.os=Smallest Code
Cicada-L082CZ.menu.opt.os.build.flags.optimize=-Os
Cicada-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Cicada-L082CZ.menu.opt.o1=Fast
Cicada-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Cicada-L082CZ.menu.opt.o1.build.flags.ldspecs=
Cicada-L082CZ.menu.opt.o2=Faster
Cicada-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Cicada-L082CZ.menu.opt.o2.build.flags.ldspecs=
Cicada-L082CZ.menu.opt.o3=Fastest
Cicada-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Cicada-L082CZ.menu.opt.o3.build.flags.ldspecs=


# Tlera Gnat
# ---------------------------------------
Gnat-L082CZ.name=Gnat-L082CZ
Gnat-L082CZ.vid.0=0x1209
Gnat-L082CZ.pid.0=0x6662

Gnat-L082CZ.upload.tool=stm32l0_dfu
Gnat-L082CZ.upload.protocol=dfu
Gnat-L082CZ.upload.maximum_size=196608
Gnat-L082CZ.upload.maximum_data_size=20480
Gnat-L082CZ.upload.use_1200bps_touch=true
Gnat-L082CZ.upload.wait_for_upload_port=false
Gnat-L082CZ.upload.native_usb=false

Gnat-L082CZ.build.mcu=cortex-m0plus
Gnat-L082CZ.build.f_cpu=32000000L
Gnat-L082CZ.build.board=STM32L0_GNAT
Gnat-L082CZ.build.arch=stm32l0
Gnat-L082CZ.build.core=arduino
Gnat-L082CZ.build.vid=0x1209
Gnat-L082CZ.build.pid=0x6662
Gnat-L082CZ.build.did=0xffff
Gnat-L082CZ.build.usb_manufacturer="Tlera Corporation"
Gnat-L082CZ.build.usb_product="Gnat"
Gnat-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
Gnat-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Gnat-L082CZ.build.openocdscript=openocd_scripts/gnat-l082cz.cfg
Gnat-L082CZ.build.variant=Gnat-L082CZ
Gnat-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Gnat-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

Gnat-L082CZ.menu.usb.cdc=Serial
Gnat-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Gnat-L082CZ.menu.usb.none=No USB
Gnat-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

