e-tinkers/ArduinoCore-stm32l0/boards.txt
Gnat-L082CZ.menu.speed.32=32 MHz
Gnat-L082CZ.menu.speed.32.build.f_cpu=32000000L
Gnat-L082CZ.menu.speed.16=16 MHz (No USB)
Gnat-L082CZ.menu.speed.16.build.f_cpu=16000000L
Gnat-L082CZ.menu.speed.4=4.2 MHz (No USB)
Gnat-L082CZ.menu.speed.4.build.f_cpu=4200000L

Gnat-L082CZ.menu.opt.os=Smallest Code
Gnat-L082CZ.menu.opt.os.build.flags.optimize=-Os
Gnat-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Gnat-L082CZ.menu.opt.o1=Fast
Gnat-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Gnat-L082CZ.menu.opt.o1.build.flags.ldspecs=
Gnat-L082CZ.menu.opt.o2=Faster
Gnat-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Gnat-L082CZ.menu.opt.o2.build.flags.ldspecs=
Gnat-L082CZ.menu.opt.o3=Fastest
Gnat-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Gnat-L082CZ.menu.opt.o3.build.flags.ldspecs=


# ST B-L072Z-LRWAN1
# ---------------------------------------
B-L072Z-LRWAN1.name=B-L072Z-LRWAN1
B-L072Z-LRWAN1.vid.0=0x0483
B-L072Z-LRWAN1.pid.0=0x374b

B-L072Z-LRWAN1.upload.tool=stm32l0_openocd
B-L072Z-LRWAN1.upload.protocol=stlink
B-L072Z-LRWAN1.upload.maximum_size=196608
B-L072Z-LRWAN1.upload.maximum_data_size=20480
B-L072Z-LRWAN1.upload.use_1200bps_touch=true
B-L072Z-LRWAN1.upload.wait_for_upload_port=false
B-L072Z-LRWAN1.upload.native_usb=false

B-L072Z-LRWAN1.build.mcu=cortex-m0plus
B-L072Z-LRWAN1.build.f_cpu=32000000L
B-L072Z-LRWAN1.build.board=STM32L0_B_L072Z_LRWAN1
B-L072Z-LRWAN1.build.arch=stm32l0
B-L072Z-LRWAN1.build.core=arduino
B-L072Z-LRWAN1.build.vid=0x0483
B-L072Z-LRWAN1.build.pid=0x374b
B-L072Z-LRWAN1.build.did=0xffff
B-L072Z-LRWAN1.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
B-L072Z-LRWAN1.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
B-L072Z-LRWAN1.build.openocdscript=openocd_scripts/b-l072z-lrwan1.cfg
B-L072Z-LRWAN1.build.variant=B-L072Z-LRWAN1
B-L072Z-LRWAN1.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
B-L072Z-LRWAN1.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

B-L072Z-LRWAN1.menu.speed.32=32 MHz
B-L072Z-LRWAN1.menu.speed.32.build.f_cpu=32000000L
B-L072Z-LRWAN1.menu.speed.16=16 MHz (No USB)
B-L072Z-LRWAN1.menu.speed.16.build.f_cpu=16000000L
B-L072Z-LRWAN1.menu.speed.4=4.2 MHz (No USB)
B-L072Z-LRWAN1.menu.speed.4.build.f_cpu=4200000L

B-L072Z-LRWAN1.menu.opt.os=Smallest Code
B-L072Z-LRWAN1.menu.opt.os.build.flags.optimize=-Os
B-L072Z-LRWAN1.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
B-L072Z-LRWAN1.menu.opt.o1=Fast
B-L072Z-LRWAN1.menu.opt.o1.build.flags.optimize=-O1
B-L072Z-LRWAN1.menu.opt.o1.build.flags.ldspecs=
B-L072Z-LRWAN1.menu.opt.o2=Faster
B-L072Z-LRWAN1.menu.opt.o2.build.flags.optimize=-O2
B-L072Z-LRWAN1.menu.opt.o2.build.flags.ldspecs=
B-L072Z-LRWAN1.menu.opt.o3=Fastest
B-L072Z-LRWAN1.menu.opt.o3.build.flags.optimize=-O3
B-L072Z-LRWAN1.menu.opt.o3.build.flags.ldspecs=


# ST I-NUCLEO-LRWAN1
# ---------------------------------------
I-NUCLEO-LRWAN1.name=I-NUCLEO-LRWAN1
I-NUCLEO-LRWAN1.vid.0=0x0483
I-NUCLEO-LRWAN1.pid.0=0x374b

I-NUCLEO-LRWAN1.upload.tool=stm32l0_openocd
I-NUCLEO-LRWAN1.upload.protocol=stlink
I-NUCLEO-LRWAN1.upload.maximum_size=65536
I-NUCLEO-LRWAN1.upload.maximum_data_size=8192
I-NUCLEO-LRWAN1.upload.use_1200bps_touch=true
I-NUCLEO-LRWAN1.upload.wait_for_upload_port=false
I-NUCLEO-LRWAN1.upload.native_usb=false

I-NUCLEO-LRWAN1.build.mcu=cortex-m0plus
I-NUCLEO-LRWAN1.build.f_cpu=32000000L
I-NUCLEO-LRWAN1.build.board=STM32L0_NUCLEO
I-NUCLEO-LRWAN1.build.arch=stm32l0
I-NUCLEO-LRWAN1.build.core=arduino
I-NUCLEO-LRWAN1.build.vid=0x0483
I-NUCLEO-LRWAN1.build.pid=0x374b
I-NUCLEO-LRWAN1.build.did=0xffff
I-NUCLEO-LRWAN1.build.extra_flags=-DSTM32L052xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
I-NUCLEO-LRWAN1.build.ldscript=linker_scripts/STM32L052T8_FLASH.ld
I-NUCLEO-LRWAN1.build.openocdscript=openocd_scripts/i-nucleo-lrwan1.cfg
I-NUCLEO-LRWAN1.build.variant=I-NUCLEO-LRWAN1
I-NUCLEO-LRWAN1.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l052xx -larm_cortexM0l_math
I-NUCLEO-LRWAN1.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

I-NUCLEO-LRWAN1.menu.speed.32=32 MHz
I-NUCLEO-LRWAN1.menu.speed.32.build.f_cpu=32000000L
I-NUCLEO-LRWAN1.menu.speed.16=16 MHz
I-NUCLEO-LRWAN1.menu.speed.16.build.f_cpu=16000000L
I-NUCLEO-LRWAN1.menu.speed.4=4.2 MHz
I-NUCLEO-LRWAN1.menu.speed.4.build.f_cpu=4200000L

I-NUCLEO-LRWAN1.menu.opt.os=Smallest Code
I-NUCLEO-LRWAN1.menu.opt.os.build.flags.optimize=-Os
I-NUCLEO-LRWAN1.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
I-NUCLEO-LRWAN1.menu.opt.o1=Fast
I-NUCLEO-LRWAN1.menu.opt.o1.build.flags.optimize=-O1
I-NUCLEO-LRWAN1.menu.opt.o1.build.flags.ldspecs=
I-NUCLEO-LRWAN1.menu.opt.o2=Faster
I-NUCLEO-LRWAN1.menu.opt.o2.build.flags.optimize=-O2
I-NUCLEO-LRWAN1.menu.opt.o2.build.flags.ldspecs=
I-NUCLEO-LRWAN1.menu.opt.o3=Fastest
I-NUCLEO-LRWAN1.menu.opt.o3.build.flags.optimize=-O3
I-NUCLEO-LRWAN1.menu.opt.o3.build.flags.ldspecs=


# ST P-NUCLEO-LRWAN1
# ---------------------------------------
P-NUCLEO-LRWAN1.name=P-NUCLEO-LRWAN1
P-NUCLEO-LRWAN1.vid.0=0x0483
P-NUCLEO-LRWAN1.pid.0=0x374b

P-NUCLEO-LRWAN1.upload.tool=stm32l0_openocd
P-NUCLEO-LRWAN1.upload.protocol=stlink
P-NUCLEO-LRWAN1.upload.maximum_size=196608
P-NUCLEO-LRWAN1.upload.maximum_data_size=20480
P-NUCLEO-LRWAN1.upload.use_1200bps_touch=true
P-NUCLEO-LRWAN1.upload.wait_for_upload_port=false
P-NUCLEO-LRWAN1.upload.native_usb=false

P-NUCLEO-LRWAN1.build.mcu=cortex-m0plus
P-NUCLEO-LRWAN1.build.f_cpu=32000000L
P-NUCLEO-LRWAN1.build.board=STM32L0_NUCLEO
P-NUCLEO-LRWAN1.build.arch=stm32l0
P-NUCLEO-LRWAN1.build.core=arduino
P-NUCLEO-LRWAN1.build.vid=0x0483
P-NUCLEO-LRWAN1.build.pid=0x374b
P-NUCLEO-LRWAN1.build.did=0xffff
P-NUCLEO-LRWAN1.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
P-NUCLEO-LRWAN1.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
P-NUCLEO-LRWAN1.build.openocdscript=openocd_scripts/p-nucleo-lrwan1.cfg
P-NUCLEO-LRWAN1.build.variant=P-NUCLEO-LRWAN1
P-NUCLEO-LRWAN1.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
P-NUCLEO-LRWAN1.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

